
/*
 TBApiClient.m
 */
"unknown_error"="Unknown Error";
"unknown_data_type"="Unknown Data Type";

/*
 TBTabBarController.m
 */
"Assets"="Assets";
"Markets"="Markets";
"Discover"="Discover";
"Profile"="Me";
"Exchanges"="Exchanges";

/*
 TBCustomMJRefreshFooter.m
 */
"reach_bottom"="Oops, on bottom";
"slide_load_more"="Slide up";
"loading_more"="Loading more...";

/*
 TBCameraUtils.m
 */
"warm_tip"="Tips";
"camera_setting_tips"="Allow Camera Usage at [Settings - TokenPocket - Camera]";
"confirm"="Confirm";
"album_access_failed"="Cannot access album for system reasons";
"no_camera"="Cannot detect the camera";

/*
 NSDate+TB.m
 */
"just_now"="just now";
"one_min_ago"="minute ago";
"n_min_ago"="minutes ago";
"one_h_ago"="hour ago";
"n_h_ago"="hours ago";
"one_day_ago"="day ago";
"n_day_ago"="days ago";
"one_m_ago"="month ago";
"n_m_ago"="months ago";
"one_y_ago"="year ago";
"n_y_ago"="years ago";

"trans_record"="Transaction Records";
"transaction_succ"="Transaction Successed";
"trans_fail"="Transaction Failed";
"transing"="Transaction Processing";
"copy"="Copy";
"copy_to_board"="Copied to Pasteboard";
"trans_query"="Transaction Query";
"trans_detail"="Transaction Detail";

"transaction"="Send";
"package_fail"="Package failed";
"packaging"="Pending";
"trans_suc"="Transaction Successed";
"trans_fai"="Transaction Failed";
"trans_to_self"="Don't transfer to yourself";
"wrong_addr_tips"="Wrong address, please examine";
"no_enough_token"="No sufficient currencies";
"next_step"="Next";
"wallet_addr"="Wallet Addresses";
"input_paste_addr"="Input or Paste addresses";

"trans_amount"="Amount";
"input_out_amount"="Input transfer amount";
"miner_fee"="Fee";
"select_fee"="Select miners' fee";
"comment"="Memo";
"trans_num"="TX#";
"blc_num"="Block Height";
"trans_time"="TimeStamp";
"copy_url"="Copy URL";
"choose_token_trans"="Choose Transfer Tokens";

"req_exchange_list_fail"="Request List Failed";

"wrong_and_try_later"="Oops, try later.";
"all"="All";


"receive"="Receive";
"receiver"="Receiver";
"copied"="Copied";
"copy_wallet_addr"="Copy";
"rece_amount"="Receipt Amount";
"set_rec_amount"="Set Receive Amount";

"cannot_recog_qrcode"="Cannot recognize the QR Code";
"align_qrcode"="Align QR Code within frame to scan";
"album"="Album";
"scan"="Scan";

"input_asset_name"="Input asset's name";
"cancel"="Cancel";
"confirm"="Confirm";
"hot_coin"="Hot Tokens";
"coming_soon"="Coming soon";

"add_tokens"="Tokens";
"support_token_tip"="Supporting Blockchain Assets like Ethereum, ERC20, SWTC etc.";
"all_wallet"="All Wallets";
"no_wallet_tips"="No wallets, Create one.";
"ok"="OK";

"how_to"="How-to";
"advanced"="Advanced";

"custom_gas_price"="Custom Gas Price";
"custom_gas"="Custom Gas";

/*
 TBTransactionConfirmView.m
 */
"input_pwd"="Please input password";
"confirm"="Confirm";

/*
 TBAssetHeader.m
 */
"my_asset"="My Assets";

/*
 TBAssetPopWindow.m
 */
"create_wallet"="Create Wallet";

/*
 TBSearchTokenCell.m
 */
"added"="Added";
"add"="Add";

/*
 TBAssetCreateWalletView.m
 */
"all_wallet"="All Wallets";
"has_no"="No ";
"title_wallet"=" Wallet";
"wallet"="Wallets";
"s_wallet"="'s wallet";
"s_only_token_chain"="'s tokens can only be stored in its own chain type.";

/*
 TBDiscoveryViewController.m
 */
"dapp_recomd"="DApp Store";
"articles"="Articles";
"hot_articles"="News";
"news_flash"="News";
"source"="Source";
/*
 TBExchangeWalletVewController.m
 */
"switch_account"="Switch Account";

/*
 TBMineViewController.m
 */
"personal_center"="Personal Center";
"msg"="Message";
"contact"="Contact";
"help"="Help Center";
"about"="About Us";
"settings"="Settings";

/*
 TBEditWalletViewController.m
 */
"saving"="saving";
"save_succ"="Saved Successfully";
"save_fail"="Saved Fail";
"save"="Save";
"exporting"="Exporting..";
"delete_caution"="Caution! This operation cannot be revoked!";
"delete_succ"="Deleted Successfully";
"delete_fail"="Deleted Fail";
"pwd_error"="Password Error";
"pwd_not_match"="Password doesn't match";
"export_fail"="Export Fail";

/*
 TBSettingViewController.m
 */
"login_pwd"="Password Login";
"login_faceid"="Face ID";
"login_touchid"="Touch ID";
"language"="Language";
"currency_unit"="Currency Unit";
"web3_setting"="Web3 Setting";
"set"="Set ";
"cancel"="Cancel";
"setting_nodes"="Nodes Setting";

/*
 TBMessageCenterViewController.m
 */
"read_all"="Read All";

/*
 TBMemonicImportWalletViewController.m
 */
"custom_path"="Your Custom Path";
"service_privacy"="Service and Privacy Policy";
"importing"="Importing...";
"m_new_wallet"="M-Wallet";
"import_succ"="Import Successfully";
"import_fail"="Import Failed";
"input_mnemonic_words"="Please use space to separate the mnemonic words";

/*
 TBPrivateKeyImportWalletViewController.m
 */
"term_service"="Term of Service";
"wallet_exist"="Wallet Existed";
"pk_wallet"="PK-Wallet";
"ks_wallet"="KS-Wallet";

/*
 TBChooseTokenSystemViewController.m
 */
"choose_blc_type"="Choose Foundation";
"created"="Already Created";


/*
 TBImportWalletViewController.m
 */
"import_wallet"="Import Wallet";
"mnemonic"="Mnemonic";
"keystore"="Keystore";
"pri_key"="Private Key";
"pub_key"="Public Key";
/*
 TBCreateBackupViewController.m
 */
"backup_mnem"="Backup Mnemonic";
"backup_mnem_tips"="These mnemonic words are for recovering your wallet, write down correctly on paper and keep in a safe place.";
"backup_pk"="Backup Private Key";
"backup_pk_tips"="These private key are for recovering your wallet, write down correctly on paper and keep in a safe place.";

/*
 TBConfirmMemonicViewController.m
 */
"confirm_result"="Confirm Result";
"reconfirm_mnemonic"="Confirm failed, please examine your mnemonic words.";
"reconfirm_pk"="Confirm failed, please examine your private key.";
"backup_succ"="Backup Successfully";

/*
 TBCreateWalletViewController.m
 */
"choose_wallet_chain_type"="Choose Blockchain Foudation";
"complete_info"="Please complete info";
"read_and_agree"="Read and Agree with Service and Privacy Policy";
"tips"="Tips";
"create_succ"="Create Wallet Successfully";
"create_fail"="Create Wallet Failed";

/*
 TBBackupWalletViewController.m
 */
"backup_wallet"="Backup Wallets";

/*
 TBSelectChainTypeViewController.m
 */
"choose_blc_type"="Blockchain Foundation";
"chain_info_retry"="Oops, Please Slide Down";
"already_wallet"="Cannot import, you already have";
"illegal_mnem"="Illegal mnemonic, please check";

/*
 TBWalletManagerViewController.m
 */
"wallet_manage"="Manage Wallets";
"total_asset"="Assets Overview";

/*
 TBAboutUsViewController.m
 */
"pri_policy"="Privacy Policy";
"ver_release"="Version Release";
"check_update"="Check for updates";
"app_guide"="App Guide";

/*
 TBEditPasswordViewController.m
 */
"modify_succ"="Modified successfully";
"modify_fail"="Modified fail";
"change_pwd"="Change Password";
"done"="Done";

/*
 TBMessageCenterCell.m
 */
"receiver"="Receiver";
"trans_succ"="Transfer Successfully";
"trans_noti"="Transfer Notification";
"sender"="sender";

/*
 TBChooseTokenSystemCell.m
 */
"blc_type"="Blockchain Foundation";

/*
 TBPasswordView.m
 */
"weak"="Weak";
"normal"="Normal";
"good"="Good";
"safe"="Safe";

/*
 TBAboutUsCell.m
 */
"curr_version"="Current Version:";

/*
 TBWalletChainCell.m
 */
"created"="existed";

/*
 TBTransactionRecoderCell.m
 */
"processing"="Pending";

/*
 TBMarketEditViewController.m
 */
"all_select"="Select All";
"unselect"="Unselect All";
"delete_fail_retry"="Delete Failed, Please Retry.";
"delete"="Delete";

/*
 TBMarketViewController.m
 */
"no_token_go_add"="You have no tokens, go and add some.";

/*
 TBMarketSearchViewController.m
 */
"search_token_market"="Search Token Tendency";
"add_fail"="Add Failed";
"hot_rec"="Recommends";

/*
 TBJTManager.m
 */
"missing_param"="Missing Parameters";
"sign_failed"="local sign failed";

/*
 TBAuthPasswordViewController.m
 */
"repeat_pwd"="Repeat";
"pls_repeat_pwd"="Please repeat the password";
"input_pwd_auth"="Repeat Password to Authorization";
"contact_us"="Oops, contact us!";
"wrong_pwd"="Wrong, try again";
"no_deviceId"="Sorry, your device don't support Touch ID/Face ID";
"deviceId_wrong"="Touch ID/Face ID authentication failed";
"auth_fail_to_pwd"="Touch ID/Face ID locked, input your password.";
"setting_succ"="Setting successfully";

/*
 TBForceCreateWalletViewController.m
 */
"usr_agreement"="User Agreement";

/*
 TBEnterAuthViewController.m
 */
"auth_pwd"="Auth with Password";
"touch_pwd"="Wake up Password";
"touch_touchId"="Wake up Touch ID";
"touch_faceId"="Wake up Face ID";

/*
 AppDelegate.m
 */
"update_tips"="Token Pocket Updated, Enjoy it.";
"go_download"="Go to download";

/*
 JHPieChart.m
 */
"amount"="Amount";
"rate"="Rate";

/*
 TBAuthID.m
 */
"input_pwd1"="Password";
"auth_with_touchId"="Authenticate Touch ID Through Home Button";

/*
 TBTransactionEmptyView
 */
"soon"="Coming Soon";
"de_exchange"="Decentralized Global Digital Assets Exchanges";

/*
 TBMarketHeader.h
 */
"now_price"="Price";
"change_ratio"="Change";
"no_market_tendency"="Oops, no market tendency";
"add_tendency"="Add Tendencies";

"pay_wallet"="From";
"trans_out"="To";
"trans_info"="TX Info";
"trans_detail"="Transaction Detail";
"confirm_trans"="Transfer";

"fee_setting"="Fee Setting";
"gas_slow"="Slow";
"gas_fast"="Fast";
"gas_rec"="recommand";

"wallet_delete"="Delete Wallet";
"wallet_addr"="Address";
"change_pwd"="Reset Password";
"export_pk"="Export PK";
"export_keystore"="Export Keystore";
"addr_copy"="Copy";

"pwd_curr"="Old One";
"pwd_new"="Reset";
"pwd_repeat"="Repeat";
"pwd_forget"="Forget it? You can recover from ";
"import_imid"="Importing";

"pla_pwd_curr"="Your Old Password";
"pla_pwd_new"="Your New Password";
"pla_pwd_repeat"="Repeat Password";

"total_asset_title"="Total Assets";
"title_share_to"="Share To";
"title_button_cancel"="Cancel";
"wx_frnds"="Wechat Friends";
"wx_timeline"="Moments";
"share_qq"="QQ";

"tip_one"="Password strength is critical to guard your wallet.";
"tip_two"="We can't recover the password, please backup cautiously.";

"wallet_foundation"="Foundation";
"wallet_name"="Wallet Name";
"set_pwd"="Password";
"pwd_hint"="Password Hint";
"pwd_optional"="optional";
"read_agree"=" Read & agree with";
"input_private_key"="Please input your private key";
"input_public_key"="Please enter the public key or account";
"derive_path"="Path";
"import_start"="Start Importing";
"ks_pwd"="Keystore password";
"input_ks_key"="Please input your keystore";
"what_is_ks"="What's keystore?";
"import_ks_desc"="Copy and paste wallet Keystore file contents directly into the input box. Or through the production of keystore content two-dimensional code, scan entry.";
"import_ks_tips"="Please check the keystore input is correct, it is recommended to directly copy and paste.";

"pwd_length_tip"="At least 8 characters, better to mix letters, digits, symbols.";
"pwd_length_weak"="Password is too weak, easily get hacked.";

"mnemonic_write_down"="Please backup the mnemonic words";
"pk_write_down"="Please backup the private key";
"confirm_mnemonic_title"="Confirm your mnemonic words";
"confirm_pk_title"="Confirm your private key";
"confirm_mnemonic_desc"="Please choose mnemonic words in order and make sure your mnemonic was correct written";
"confirm_pk_desc"="Please enter the wallet private key to verify that the backup's private key is correct";
"entry_agree"="Agree with Service and Privacy Policy to Enter";
"tap_reauth"="Retry";

"send_trans_fail"="Unable to Make a Transaction";
"desc_wrong_pwd"="Wrong Password";

"backup_wallet_line_prefix"="For your wallet";
"backup_wallet_line_suffix"="'s safety";
"backup_tips"="Please backup the mnemonic or the private key";
"backup_now"="Backup now";

"read_first"="Read the Policies First";
"about_us_desc"="TokenPocket is a Safe, Simple and Powerful digital assets light wallet. We aim to make Blockchain happen to average users.";

"phone_num"="Phone";
"e_mail"="E-mail";
"contact_comment"="Comment";
"title_contact"="Contacts";

/*
 * TBExportKeystoreViewController
 */
"export_ks"="Expor Keystore";
"qrcode"="QR Code";
"ks_file"="Keystore file";
"copy_ks"="Copy Keystore";
"off_line_save"="Save offline";
"off_line_save_tips"="Please copy and paste the Keystore file to a safe, offline place to save. Do not save to e-mail, notepad, web disk, chat tools, etc., very dangerous.";
"no_net_transmission"="Do not use network transmission";
"no_net_transmission_tips"="Do not transfer keystore files through network tools. Once acquired by hackers, irreparable loss of assets will result. It is recommended that offline devices transmit by scanning the QR code";
"password_safe_deposit"="Password safe deposit";
"password_safe_deposit_tips"="If you need to save online, it is recommended that you use a password security software such as 1Password to save Keystore.";
"only_scan"="For direct scanning only";
"only_scan_tips"="The QR code prohibits saving, screenshots, and photographing. Only for users to scan directly in a secure environment to facilitate the import wallet.";
"use_safely"="Use in a safe environment";
"use_safely_tips"="Please use it to ensure that there is no one around and no camera. The QR code, once acquired by others, will cause irreparable loss of assets.";
"confirmed_no_p_c"="Confirmed nobody or camera around";
"show_code"="Display QR code";
"no_screenshots"="Do not take screenshots";
"make_sure_safely"="Please make sure there is no one around and no camera! Do not save keystore files or corresponding QR codes by taking screenshots or taking photos";
"i_know"="Understood";

/*
 * TBAssetSearchTokenViewController
 */
"search_token_placeholder"="Enter the token or contract address";

/*
 * TBEOSMapViewController
 */
"eos_blc_eth"="Ethereum";
"eos_blc_eth_desc"="Ethereum Foundation";
"eos_wallet_vc_title"="We just created an EOS wallet for you, please BACKUP.";
"eos_important_tips"="Attention：";
"eos_backup_desc"="Please write your private key on wallet, and keep it safe. Don't store it on cloud.";
"eos_title_wallet"="EOS Wallet";
"eos_start_backup"="Backup";
"eos_use_exist_wallet"="Use my own EOS wallet";
"eos_wallet_creating"="Generating...";
"eos_title_eth_wallet"="Eth Wallet";
"eos_title_pubkey"="EOS Pub";
"eos_title_to_add"="To-Address";
"eos_title_amount"="Amount";
"eos_title_miner_fee"="Miner Fee";
"eos_btn_mapping"="Start Mapping";
"eos_placeholder_select_wallet"="Select a mapping wallet";
"eos_title_contract_add"="Address Detail";
"eos_title_mapping_info"="Mapping Info";
"eos_map_success"="Success!";
"eos_tips_select_wallet"="Choose an Eth-Wallet";
"eos_tips_input_eos"="No EOS PublicKey found";
"eos_mapped"="This wallet was mapped";
"eos_mainnet_tip"="After mapping successfully, Tokens will transfer to your EOS address after mainnet release.";
"eos_title_eth_add"="ETH Address:";
"eos_title_eos_add"="EOS Address:";
"eos_map_verify_suc"="Verify Successfully";
"eos_map_verify_fail"="Verify Failed";
"eos_map_verify_wait"="Processing...";
"eos_map_verify_token_prefix"="You get ";
"eos_map_verify_token_suffix"="EOS tokens";
"eos_map_verify_token_empty"="You have no EOS tokens.";
"eos_map_verify_loading"="Loading";
"eos_wallet_own_placeholder"="Tap to input your EOS Public Key";
"eos_wallet_next"="Next";
"eos_wallet_use_own_prefix"="Attention：";
"eos_wallet_use_own_suffix"="You’re using your own EOS Wallet, make sure that every character is correct, we can’t verify that for you.";
"eos_plz_input"="Please input the correct Public Key";
"eos_eth_title"="ETH Address:";
"eos_eth_address"="Choose a wallet to verify";
"eos_eth_choose"="Choose";
"eos_eth_start_verify"="Start Verifying";
"eos_eth_tips_pre"="Attention：";
"eos_eth_tips_suffix"="If you just finish the mapping operation, it won't be figure out until block has finished processing. Please try later when it happens to you.";
"eos_eth_address_empty"="Address Empty";
"eos_title_verify"="EOS Verify";
"eos_title_result"="Verify Result";
"eos_title_own_wallet"="Public Key";
"blc_basic_jt"="Jingtum";
"blc_basic_jt_desc"="Jingtum Foundation";
"blc_basic_moac"="MOAC";
"blc_basic_moac_desc"="MOAC Foundation";

/*
 * TBChooseWalletSheet
 */
"choose_wallet"="Choose wallet";
"create_or_import_wallet"="Create or import wallet";

//Nodes Setting
"eth_node_empty"="Ethereum's node is empty";
"mc_node_empty"="MOAC's node is empty";
"jt_node_empty"="Jingtum's node is empty";
"eos_node_empty"="EOS's node is empty";
"node_reset_default"="Reset to Default";

//2018-05-23
"account_chars_tip"="12 chars in [a-z1-5]";
"account_name"="Account";
"account_name_length"="Account name must be 12 chars";
"account_name_chars"="Illegal chars in account name";
"account_name_existed"="Name is already taken";
"eos_invalid_private_key"="Invalid Private Key, Please check your key";
"eos_transfer_account_placeholder"="Payee";
"eos_transfer_account_from"="Payer";
"eos_transfer_account_to"="Payee";
"eos_transfer_error_no_balance"="No balance found";
"eos_transfer_error_to_self"="Cannot transfer to self";
"eos_transfer_error_not_exist"="Account dose not exist";
"eos_transfer_error_invalid_quantity"="Invalid quantity";
"eos_transfer_error_over_balance"="Overdrawn balance";
"eos_transfer_error_memo_more"="Memo is too long";
"eos_transfer_error_mismatch"="Symbol precision mismatch";
"eos_copy_account_name"="Copy";
"eos_vote"="Vote";
"eos_vc_vote"="Vote";
"eos_vc_voted"="Voted";
"eos_vc_bp_list"="BPs";
"eos_vc_rank"="Rank";
"eos_vc_detail"="Proxies";
"eos_vote_units"="Votes";
"eos_manage_delegate"="Stake";
"eos_manage_refund"="Reclaim";
"eos_title_vote"="EOS Voting";
"eos_votes_manage"="Manage";
"eos_title_votes_manage"="Votes Managing";
"eos_vote_balance"="Balance";
"eos_vote_delegate"="Staked";
"eos_vote_refund"="Refunding";
"eos_vote_manage_desc"="· You need to stake your EOS before voting\n· You can reclaim your EOS, and will be refunded in 3 days";
"eos_vote_action_delegate"="Asset Delegating";
"eos_vote_action_refund"="Undelegating";
"eos_vote_placeholder_delegate"="Input delegate amount";
"eos_vote_placeholder_undelegate"="Input undelegate amount";
"eos_vote_progress"="Progress";
"eos_vote_votenum"="Voted";
"eos_vote_canvote"="Staked Votes";
"eos_vote_area"="Area";
"eos_request_error"="Something wrong";
"eos_incorrect_wallet"="Incorrect Wallet";
"eos_vote_suc"="Success";
"eos_vote_failed"="Try again";
"eos_voter_over"="Vote 30 Bps at most";
"eos_vc_cancel_vote"="Cancel";
"eos_vc_delegated_succ"="Success";
"eos_vc_undelegated_succ"="Success";
"eos_vc_balance_insufficent"="Balance Insufficent";
"eos_vc_staked_insufficent"="Staked Insufficent";
"eos_proxy_name"="Name";
"eos_proxy_account"="Account";
"eos_proxy_slogon"="Intro.";
"eos_proxy_name_pla"="Enter your proxy name";
"eos_proxy_account_pla"="Enter your account";
"eos_proxy_slogo_pla"="Simply describe yourself";
"eos_proxy_submit"="Submit";
"eos_proxy_contact"="Contact us for more";
"eos_proxy_state"="|  Instructions";
"eos_proxy_state_detail"="Please fill in the following information accurately. After submission, we will conduct a review as soon as possible in accordance with the user agreement. After the review, you can participate in the election.";
"eos_proxy_apply"="Apply As Proxy";
"eos_proxy_optional"="Optional";
"eos_proxy_title"="Proxy Application";
"eos_proxy_input_name"="Please enter a name";
"eos_proxy_input_account"="Please enter account";
"eos_proxy_input_slogan"="Please enter a brief introduction";
"eos_proxy_submit_success"="Submitted";
"eos_proxy_weight"="Vote Weight";
"eos_proxy_account"="Account";
"eos_proxy_location"="Location";
"eos_proxy_website"="Website";
"eos_proxy_intro"="Introduction";
"eos_proxy_vote_now"="Vote Now";
"eos_proxy_vote_weight"="Proxy Weight";
"eos_not_proxy"="Account hasn't registed as proxy";
"eos_proxy_unvote"="Unvote";
"eos_proxy_share_support"="Support at TokenPocket";
"eos_proxy_area_pla"="City,Country";
"eos_proxy_regist_proxy"="Need Authorization";
"eos_rule_vote"="Voting Rules";
"eos_rule_proxy"="Proxy Instructions";
"eos_rule_manage"="Votes Instructions";
"eos_proxy_cannot_vote_self"="Proxy Cannot vote proxies";
"blc_basic_eos"="EOS";
"blc_basic_eos_desc"="EOS Foundation";
"eos_progress_votes"="Votes";
"eos_bp_weight"="Weight";
"eos_vote_no_delegate_tip"="You need to delegate your EOS before voting.";
"eos_delegate_forward"="OK";
"eos_delegate_cancel"="Cancel";
"eos_mainnet_not_enough"="Not enough has been staked for users to reclaim";
"eos_revote_modified_tip"="You will change current voted BPs, sure to revote?";
"eos_revote_confirm"="Sure";
"eos_revote_cancel"="Nope";
"eos_import_new_account"="Create New Account";

//WebAction
"web_send_success"="Send Success";
"web_send_fail"="Send Failed";
"web_release_success"="Processing, waiting refresh";
"web_release_fail"="Release Failed";

//2018-05-24
"upgrade_tips"="Upgrade tips";

//2018-05-25
"transfer_confirming"="confirming";

//2018-05-31
"recent_transactions"="Recent Transactions";
"input_wallet_name_option"="Your Wallet Name";
"error_regi_proxy_exist"="You have already registered";
"eos_insufficient_ram"="Account has insufficient RAM.";
"eos_proxy_resign"="Resign Proxy";
"eos_error_empty_account"="Empty Account";
"eos_resign_success"="Success";
"eos_res_advanced"="Advanced";
"eos_res_title_CPU"="CPU Resource";
"eos_res_title_NET"="NET Resource";
"eos_res_title_RAM"="RAM Resource";
"eos_res_title"="Resource Manage";
"eos_ram_quota"="Quota";
"eos_ram_usage"="Usage";
"eos_cpu_ava"="Available";
"eos_cpu_stake"="Staked";
"eos_net_ava"="Available";
"eos_net_stake"="Staked";
"eos_ram_instru"="・You can use EOS to buy ram, meanwhile can sell to get EOS";
"eos_ram_buy_title"="Buy Ram";
"eos_ram_sell_title"="Sell Ram";
"eos_ram_buy_pla"="Input EOS Amount";
"eos_ram_sell_pla"="Input RAM Amount";
"eos_ram_sell_pla_new"="Input RAM Amount in KB";
"eos_ram_btn_buy"="Buy";
"eos_ram_btn_sell"="Sell";
"eos_ram_can_use_balance"="Balance";
"eos_ram_insufficient_quota"="Insufficent Quota";
"eos_request_success"="success";
"eos_sellram_float"="Cannot input decimal";
"eos_sellram_too_small"="Oops, bugs. Shounld lager than 65";
"eos_ram_alert_title"="Need Password";
"eos_resource_used"="Used";
"eos_resource_ava"="Avaliable";
"eos_resource_net_title"="NET Bandwidth";
"eos_resource_cpu_title"="CPU Bandwidth";
"eos_resource_manage_desc"="・Need to stake EOS to get resource\n・You can reclaim and get your EOS back in 3 days";
"eth_go_browser_detail"="Go to Etherscan for details >";
"eos_go_browser_detail"="Go to view details";
"eos_search_bp"="  Search name or account";
"eos_account_created"="Your device has created an account";
"eos_account_not_support"="Don't support creating right now";
"eos_staked_amount_title"="Staking";

//2018-06-12
"title_contact_us"="Contact Us";
"eos_no_enough_resource"="Not enough resource. Go to Resource Manage";
"eos_stake_no_resource"="Sorry, insufficient resource (NET or CPU) for this action, you can try a smaller amount.";
"eos_net_input_account"="Receiver's Account";
"eos_set_account_title"="Receiver Setting";
"eos_res_receiver"="Receiver";
"eos_res_rece_self"="self";

//2018-06-12 16:00
"eos_recoder_type_sell_ram"="Sell ram";
"eos_recoder_type_buy_ram"="Buy ram";
"eos_recoder_type_stake"="Stake";
"eos_recoder_type_unStake"="Reclaim";
"eos_no_ram_to_buy"="RAM resource is insufficient, please go to the resource management page to get";
"wallet_retry"="Retry";
"wallet_retry_tips"="Net jam, please try again";
"eos_transfer_to_address"="Invalid Account, please check.";
"eos_cancel_success"="Cancel Successfully";
"eos_insufficient_ram"="Insufficient RAM";

//2018-6-14
"contract_address"="Contract";
"tip_backup"="Backup";

//2018-6-15
"eos_create_title"="Register helper";
"creator"="Creator";
"account_pk"="Account Public Key";
"account_pk_placeholder"="Enter public key or scan";
"onwer_pk"="Owner";
"activity_pk"="Active";
"dispatch_ram"="Allocate ram";
"dispatch_cpu"="CPU stake";
"dispatch_net"="NET stake";
"grade_model"="Advanced Mode";
"easy_model"="Simple Mode";
"register_first"="Create Now";
"register_account_success"="Create account successfully";
"register_account_fail"="Create account failed";
"eos_title_select_account"="Select Your Account";
"eos_import_next"="Next";
"eos_import_no_account"="This private key has no account, please check it and try again!";
"eos_no_active_bid"="no active bid for name";
"eos_account_been_created"="Account was created";
"eos_only_suffix_create"="Only suffix may create this account";
"eos_symbol_precision_mismatch"="Symbol precision mismatch";
"eos_create_wallet_help"="Instructions";

//2018-6-17
"share"="Share";

//2018-6-18
"title_contact_type"="Contact information";
"eos_proxy_vote_ticket"="Proxy votes";
"eos_proxy_vote_people"="Proxy voters";
"eos_proxy_wechat"="Wechat";
"eos_proxy_qq"="QQ";
"eos_proxy_wechat_pla"="Please enter your Wechat";
"eos_proxy_qq_pla"="Please enter your QQ";

//2018-6-18 10:11
"eos_right_owner"="Owner";
"eos_right_active"="Active";
"eos_right_threshold"="Threshold";
"eos_right_link_pub"="Public Keys";
"eos_right_weight"="Weight";
"eos_faq_owner_title"="What is Owner ?";
"eos_faq_owner_expl"="The Owner represents the ownership of the account and can set permissions to manage Active and other roles.";
"eos_faq_active_title"="What is Active ?";
"eos_faq_active_expl"="Active is used for daily usage such as transfer, voting, etc.";
"eos_faq_threshold"="What is Threshold ?";
"eos_faq_threshold_expl"="Threshold is the lowest weight required while operating.";
"eos_authority_management"="Permissions";
"eos_auth_new_pubkey"="Input the new Public Key";
"eos_auth_submit"="Submit";
"eos_change_owner"="Change Owner";
"eos_change_active"="Change Active";
"eos_has_no_auth"="You have no permissions to use this account.";
"eos_pub_key_empty"="New public key cannot be empty.";

//2018-6-19 6:50
"eos_invalid_public_key"="Invalid public key.";
"eos_per_modify_title"="Change Info";
"eos_per_account"="Account";
"eos_per_permission"="Permission";
"eos_per_public"="New Key";
"eos_per_confirm_change"="Confirm";
"eos_no_any_permission"="You don't have any permission, wanna delete it ?";
"eos_proxy_input_area"="Please enter location";

//2018-6-19 13:00
"eos_key_helper"="Key Generator";
"eos_key_touse"="Use";
"eos_key_back_ask"="Make sure that you have backuped the private key!!!!";
"eos_faq_what_icon"="What are these icons?";
"eos_icon_auth_change"="Change Authority";
"eos_icon_self"="Yourself";

//2018-6-19 15:27
"eos_refund_countdown"="Refunding";
"eos_refund_countdown_finish"="Refund Counting Finish";
"eos_refund_btn_title"="Refund";
"eos_refund_hour"="hour";
"eos_refund_day"="day";
"eos_refund_min"="min";
"refund_failed"="Operating Failed";
"refund_success"="Refund Successfully";
"eos_request_auth_not_satisfy"="Keys and Permissions don't satisfied.";
"notice_title_warning"="Warning";
"notice_content_permission_tips"="・Confirm that the PublicKey is correct before you change.\n・You should change the permission from Active to Owner in range.\n・Make sure your assets are safe.";

//2018-6-20
"about_unstake"="About reclaim";
"about_unstake_tips"="EOS for your stake back to the current account as much as possible, it is recommended that you keep at least 0.2 EOS in the stake as a resource consumption reclaim.";
"eos_current_wrong_wallet"="Choose EOS wallet to continue service \n：）";
"eos_current_wrong_wallet_title"="Warming Tips";
"title_create_wallet"="Create";
"more"="More";
"pwd_forget_title"="forget password?";

//2018-6-25
"eos_buy_to_self"="Self";
"eos_buy_to_other"="Others";
"eos_tap_to_refund"="Tap Refund";
"stake_style_title"="Transfer or not";
"stake_style_trans"="Transfer";
"stake_style_no_trans"="Lease";
"eos_ram_price"="RAM Price";
"eos_cpu_price"="CPU Price";
"eos_net_price"="NET Price";
"eos_main_ram"="All RAM";
"eos_ram_chart_title"="RAM Chart";
"eos_res_title_ram"="RAM";
"eos_res_title_net"="NET";
"eos_res_title_cpu"="CPU";
"eos_main_res_title"="Resources";

//2018-6-28
"eos_stake_no_cpu"="CPU resource is insufficient, please go to the resource management page to get";
"eos_stake_no_net"="NET resource is insufficient, please go to the resource management page to get";
"eos_account_create"="Free account registering ended, you can pay to create an account";
"error_bidname_lower"="Your bid price maybe a little low";

//2018-6-29
"contact_create"="New Contact";
"contact_edit"="Edit Contact";
"add_wallet_address"="Add wallet address";
"add_wallet_type"="wallet bottom";
"add_wallet_address_account"="address";
"add_wallet_address_account_tips"="Scan or paste wallet address";
"contact_delete_tips"="Are you sure to delete?";
"choose_address"="Please select the address";

//2018-06-30
"import_pwd_empty"="Password Empty";

//2018-07-01
"rammark_pie_title"="Distribution";
"rammark_pie_big"="Large";
"rammark_pie_med"="Medium";
"rammark_pie_small"="Small";
"rammark_pie_in"="Buy";
"rammark_pie_out"="Sell";
"rammark_pie_deals"="distributions";
"rammark_top_open"="Open";
"rammark_top_total"="Capital";
"rammark_top_ramratio"="Occupancy";
"rammark_buy_record"="Orders";
"rammark_bigbuy_record"="Large Orders";
"rammark_huge_holds"="Huge Holders";
"rammark_title_buy"="Buy";
"rammark_title_sell"="Sell";
"rammark_action_buy"="Buy";
"rammark_action_sell"="Sell";
"rammark_input_placeholder"="Input amount";
"rammark_title"="RAM Exchange";
"rammark_state"="In trading";

//2018-07-02
"eos_byte_keep_tips"="It is recommended to reserve 1024 bytes for the memory consumption of this operation.";
"eos_ram_exchange_ent"="   RAM Exchange   ";
"eos_create_account_tips"="Incomplete information, cannot create the account.";
"eos_create_account_cost"="Cost";

//2018-07-05
"order_tips"="EOS account needs to consume EOS, please find a trusted account with EOS balance to help you pay this creation fee.";
"order_title"="Order information";
"order_delete"="Delete Order";
"order_create_for_other"="Seek Help";
"order_account_active"="Active";
"order_account_active_success"="Active succeeded";
"order_account_warn_owner_active"="The account has multiple private keys with onwer and active permissions, which is extremely risky.";
"order_account_warn_owner"="The account has multiple private keys with onwer privileges, which is extremely risky.";
"order_account_warn_active"="The account has multiple private keys with active permissions, which is extremely risky.";
"order_account_warn_only_owner"="You only have the onwer permission for this account, which is extremely risky.";
"order_account_warn_only_active"="You only have active permissions for this account, which is extremely risky.";
"order_account_register_other"="The account is cybersquatted by others, there may be security issues, please be cautious";
"order_account_not_create"="Account has not been registered";
"order_delete_tips"="Are you sure to delete the order?";
"order_continue_tips"="You have an uncomplete order, do you wanna finish it ?";
"eos_localaccount_exception"="Please check whether you have enough CPU, NET, RAM or balance.";
"order_pre_tips_confirm"="If you confirm that all permissions under this account are correct, you can import the wallet with your private key.";
"res_requried_tips"="Trading operations will consume resources. Please pay attention to your memory computing network resources. We recommend that the network and computing resources be at least 0.5 EOS, if your resources are insufficient, your transaction will be rolled back by the block.";
"success_wait_block_require"="Submit successfully, pending block confirmation";

"unstake_cpu_all"="You cannot reclaim all CPU, please leave 0.4 EOS at least.";
"unstake_net_all"="You cannot reclaim all NET, please leave 0.4 EOS at least.";
"sell_ram_all"="In order to make the transaction success, you should leave 100 Bytes at least.";
"order_teach"="Go to tutorials";
"order_teach_title"="Tutorials";

//2018-07-09
"eos_no_account"="No account";
"eos_pk_check"="Check private key";
"eos_pubk_check"="Check account by public key";
"app_version_last"="Already the latest version";
"app_share_friends"="Invite Friends";

//2018-07-11
"eos_ran_remind"="Price Alert";
"eos_ran_remind_introduce"="TokenPocket alert has two styles:";
"eos_ran_remind_price"="Price Alert";
"eos_ran_remind_price_tips_1"="Price warnings are divided into upper and lower prices.";
"eos_ran_remind_price_tips_2"="When the price reaches a certain location, the system will issue an alarm. The same price will be alarmed up to 4 times per day, and 12 messages per day will be pushed as the upper limit.";
"eos_ran_remind_price_tips_3"="Up to 3 price alerts can be set at the same time.";
"eos_ran_remind_big"="Large tracking alert";
"eos_ran_remind_big_tips_1"="The big account tracking behavior is divided into buy tracking and sell tracking.";
"eos_ran_remind_big_tips_2"="When the buy and sell reaches the setting value or exceeds the set value, SMS will be sent. Each set value will be alarmed up to 4 times per day, and the number of daily push messages will be 12." ;
"eos_ran_remind_big_tips_3"="Up to 3 large-scale early warnings can be set at the same time.";
"eos_ran_remind_tips_1"="Note: Due to instability and delay of network environment in different regions, this service is limited to tracking and is not applicable to the implementation of pending orders. This service belongs to the TokenPocket value-added service, and the final interpretation right belongs to TokenPocket, once the subscription cannot be refunded.";
"eos_ran_remind__price_desc_pre"="The price of this service is ";
"eos_ran_remind__price_desc_suf"=" EOS/month.";
"eos_ram_open"="Purchase Now";
"eos_ram_remind_price_up"="Upper price";
"eos_ram_remind_price_down"="Lower price";
"eos_ram_remind_big_amount"="Number of alerts";
"eos_ram_remind_big_direction"="Direction";
"eos_ram_remind_add"="Add Alert";
"eos_ram_remind_big_set_title"="Huge holders tracking";
"eos_ram_remind_big_set_account"="Huge Holders";
"eos_ram_remind_big_set_direction"="Flow Direction";
"eos_ram_remind_big_set_amount_placeholder"="Please enter the quantity";
"eos_ram_remind_price_set_title"="Set warning price";
"eos_ram_remind_price_set_placeholder"="Please input the price";
"eos_ram_remind_open_confirm_title"="Price Alert Service";
"eos_ram_remind_open_confirm_phone"="Mobile";
"eos_ram_remind_open_confirm_fee"="Fees";
"eos_ram_remind_open_title"="SMS Alert";
"eos_ram_remind_open_phone"="Mobile number";
"eos_ram_remind_open_phone_placeholder"="Please input your mobile number";
"eos_ram_remind_open_tips"="Alerts only do price alerts. Due to instability and delay of network environment, they are not applicable to real-time pending orders.";
"eos_ram_remind_current_price"="Current price";
"eos_ram_remind_current_rise"="Current rise";
"eos_ram_remind_open_ret_success"="Dealt";
"eos_ram_remind_open_ret_pay_fial"="Payment failed";
"eos_create_type_transfer"="Transfer from Exchange or wallet";
"eos_create_type_scan"="Scan with TokenPocket by your friends";
"eos_create_type_select"="Select Type";
"eos_ram_remind_out_service_time"="Service Expiration Time : ";

//2018-7-11
"eos_contract_create_process"="Process Steps";
"eos_contract_create_desc1"="Create an account through tranferring at least 2.0 EOS from exchanges, 0.2 EOS will be used to stake on CPU and NET, the residual will be used to buy RAM.";
"eos_contract_create_desc2"="Currently support OTCBTC, Gate.io, Bianace, Bitfinex, don't use other exchanges. Any wallet that support memo will be supported too.";
"eos_contract_create_transaccount"="Transfer to Account (required)";
"eos_contract_create_copy"="Copy";
"eos_contract_create_memo"="Transfer Memo (required)";
"eos_contract_create_delete"="Delete Order";
"eos_contract_create_active"="Active Account";
"eos_contract_create_tip"="Cautions:\nThe creation is developed by Dappub using smart contract without manual operation, if you lost assets because of your own mistakes, we are sorry but can't help.";
"eos_contract_create_opensource"="OpenSource Url：";
"eos_contract_create_navTitle"="Contract Register";
"eos_permission_developing"="Developing";

//2018-7-14
"bl_node_eth_setting"="ETH node settings";
"bl_node_moac_setting"="MOAC node settings";
"bl_node_jt_setting"="Jingtum node setting";
"bl_node_eos_setting"="EOS node settings";
"bl_node_add_node"="Add a custom node";
"bl_node_type_default"="Default";
"bl_node_type_custom"="Custom";
"bl_node_invalid"="Please enter a valid node address";

//2018-7-16
"order_account_create_state_create"="Account creating..";
"order_account_create_state_required"="Account status confirming..";
"order_account_create_state_required_fail"="Account status confirm fail";
"order_account_create_state_safe"="Account security detecting..";

//2018-7-17
"eos_dapp_action_type"="Type";
"eos_dapp_action_detail"="Detail info";
"eos_dapp_action_type_transaction"="Transfer";
"eos_dapp_action_type_vote"="Vote";
"eos_dapp_action_type_stake"="Stake";
"eos_dapp_action_type_unstake"="Reclaim";
"eos_dapp_action_type_buyram"="Buy ram";
"eos_dapp_action_type_sellram"="Sell ram";
"eos_dapp_action_type_updateauth"="Change authority";
"eos_dapp_action_type_bidname"="Account auction";
"eos_dapp_action_type_newaccount"="Create Account";

//2018-7-18
"setting_color_switch"="Switch Color Of Candlestick";
"title_ram_my_record"=" My Records";
"invite_code_title"="Your exclusive code";
"invite_btn_title"="   Invite Now   ";
"invited_prefix"="You invited";
"invited_fnds"="friends";
"invited_win"="gain";
"invited_bonus"="bonus";
"invite_rule"="Invitation Rules:";
"invite_rules_desc"="1. During the activity, bind the phone number will gain 100 bonus, each the inviter and invitee will gain 100 bonus, the more you invite, the more you will gain.\n2. Each user can be invite once, you can confirm the invitation while importing or creating the wallet.\n3.Bonus can be exchanged to candies according to rules.\n4.Invite code bind with phone number.\n5. Follow our official telegram group （https://t.me/tokenPocket_en） to follow the exchange rules.";
"title_gain_bonus"="Take Bonus";
"invite_get_code"="   Get Activation Code   ";
"invite_bind_phone_get"="Bind your phone to gain bonus";

"invite_write_inviter"="Invitation Code";
"invite_inviter_desc_title"="Input code to gain bonus";
"invite_inviter_code_pl"="Input your code";
"invite_inviter_detail"="Code cannot be modified once confirmed, both inviter and invitee will gain bonus.";
"invite_inviter_confirm"="Confirm";
"invite_bind_phone_title"="Bind Phone";
"invite_bind_phone_desc"="Bind your phone to get invitation code";
"invite_bind_phone_pl"="Input your phone";
"invite_bind_phone_detail"="Code will be binded with phone number, you need to bind your phone before get your bonus";
"invite_code_empty"="Code cannot be empty";
"invite_code_error"="Incorrect code, check it.";
"invite_code_mine"="My exclusive code";
"invite_code_where_input"="Code can be verified on Invitation Page";
"invite_code_scan_download"="Scan To Download";
"invite_phone_empty"="Empty phone number";
"eos_transfer_memo_tips"="You're transferring to an exchange, please confirm your memo.";
"eos_transfer_ensure_continue"="Continue";
"eos_transfer_ensure_check"="Check";
"invite_gain_bonus_suc"="Wow, get the bonus";
"invite_gain_bonus_repeat"="You have got this bonus already";
"invite_bind_to_gain"="You need to bind your phone before get your bonus";
"dapp_mode_open"="Developer Mode Active";
"dapp_mode_close"="Developer Mode Closed";

//2018-7-25
"dapp_platform"="Platform";
"dapp_search"="Search";

//2018-7-26
"eos_change"="Modify";
"eos_add"="Add";
"eos_add_permission"="Add permissions";
"eos_add_permission_account"="New";
"eos_auth_new_pubkey_account"="Enter a public key or account";
"eos_ram_panel"="Ram Panel";
"eos_developer_mode_desc"="Developer Mode is used to debug the DApps based on wallet, you can define the URL after turn on the developer mode.\nThis mode is made for developers to debug only, don’t use any untrusted links, you should be responsible for your assets if you use the third-party or self-defined URL.";
"eos_developer_mode_check"="I understood the Usage and Responsibility of Developer Mode.";
"title_developer_mode"="Developer Mode";
"title_developer_edit"="Edit URL";

//2018-8-1
"enu_current_wrong_wallet"="Choose ENU wallet to continue service \n：）";

//2018-08-02
"vote_title_proxy"="Proxies Voting";
"vote_title_producer"="Producers Voting";
"vote_btn_title_stake"="Staked Manage";
"vote_btn_title_proxy"="Proxy Manage";
"vote_desc_proxy"="＊ Proxies will bring a much healthier ecosystem to the community.\n＊ A proxy can represent you to vote producers. You can revoke your votes at anytime.";
"vote_desc_producer"="＊ Before you can vote, you need to stake your EOS.\n＊ You can get your EOS back in 72 hours after reclaim.";
"vote_navi_title"="Vote";
"vote_tag_partner"="Partner";
"dapp_not_suppot"="Current DApp does not support ";

//2018-08-03
"node_reset"="Reset";

//2018-08-06
"dapp_browser"="DApp Browser";

//2018-08-07
"eos_permission_no"="The permissions of the current account have been changed, please confirm whether the account permissions are normal";
"eos_permission_no_read"="Check it";

//2018-08-07 17:12
"enu_contract_create_desc1"="Create an account through tranferring at least 2.0 ENU from exchanges, 0.2 ENU will be used to stake on CPU and NET, the residual will be used to buy RAM.";
"enu_contract_create_desc2"="Any exchanges or wallet that support memo will be supported too.";
"enu_contract_create_tip"="Cautions:\nThe creation is deployed by ENU community enthusiasts using smart contract without manual operation. if you lost assets because of your own mistakes, we are sorry but can't help";

//2018-08-08
"contact_memo_tips"="Automatically fill the memo if turn on the switch.";

"apply_pro_name_placeholder"="Input the proxy's name, 64 chars max";
"apply_pro_input_name"="Input the proxy's name";
"apply_pro_max_name"="Proxy's name length exceeds, 64 chars max";

"apply_pro_slogan_placeholder"="Input your slogan";
"apply_pro_input_slogan"="Input your slogan";
"apply_pro_max_slogan"="Slogan's length exceeds. 64 chars max";


"apply_pro_input_phi"="Write your philosophy";
"apply_pro_max_phi"="Your philosophy is too long, 1024 chars max";
"apply_pro_phi_plac"="Write your philosophy.";

"apply_pro_input_bg"="Write your background";
"apply_pro_max_bg"="Your background is too long, 1024 chars max";
"apply_pro_bg_plac"="It will help voters know more about you";
"proxy_voter_title"="Voters";
"apply_no_avatar"="set your logo";
"apply_pro_tg"="Input telegram";
"apply_pro_tw"="Your steemit address";
"apply_pro_wechat"="Your WeChat Number";
"apply_pro_web"="Input your website address";

"apply_pro_price"="This action will consume a little bit of your RAM for the storage. How much depends on the length of your data, but probably around 1kb.";

"apply_pro_avatar_uploading"="Uploading avatar";
"apply_pro_avatar_failed"="Upload avatar failed";
"apply_pro_reg_info"="Uploading proxy's info";
"apply_pro_reg_suc"="Upload successed, will be shown in a few minutes.";
"apply_pro_reg_fail"="Upload failed";
"apply_pro_reging"="Registering Proxy";
"apply_no_access_album"="Cannot access album";
"apply_tap_logo"="Tap to edit logo";
"apply_pro_delete"="Need your authorization to delete info";
"apply_pro_deleting"="Deleting proxy's info";
"apply_pro_delete_fail"="Delete proxy's info failed";
"apply_pro_delete_system"="Resigning Proxy";
"apply_pro_delete_system_fail"="Cancel Proxy Failed";
"apply_pro_delete_system_succ"="Cancel Proxy Successed";

"apply_pro_title_name"="Name";
"apply_pro_title_slo"="Slogan";
"apply_pro_title_phi"="Philosophy";
"apply_pro_title_bg"="Background";
"apply_pro_title_web"="Website";
"apply_pro_title_tele"="Telegram";
"apply_pro_title_steemit"="Steemit";
"apply_pro_title_wechat"="WeChat";

"proxy_stake_title"="Proxy Staked";
"proxy_pro_title"="Voted Producers";
"proxy_btn_vote"="Vote Him";
"proxy_btn_quit"="Quitted";
"proxy_btn_edit_info"="Edit Info";
"proxy_contact_title"="Contact";
"apply_btn_detail"="    detail »";
"proxy_voters_title"="voters";
"proxy_delete_before"="You should revoke your voted proxy before you can register";
"proxy_tilte_close"="Close";
"slogan_words"="Your universal digital wallet";
"slogan_from"="Share from TokenPocket";
"title_proxy_option"=" (optional)";

"reclaim_stake"="Reclaim";
"stake_list"="Stake List";

//2018-8-14
"dapp_suppot"="Current DApp only supports ";

//2018-8-15
"web_url_refresh"="Refresh";
"web_url_open_browser"="Open in Safari";
"web_url_power_prefix"="Powered by ";
"web_url_power_suffix"="";
//2018-8-16
"res_title_receiver"="Receiver";
"res_stake_total"="Total";
"res_input_amount_pla"="Input EOS Amount";
"res_cpu_stake_title"="Stake CPU";
"res_net_stake_title"="Stake NET";
"res_cpu_reclaim_title"="Reclaim CPU";
"res_net_reclaim_title"="Reclaim NET";
"res_reclaim_takeback"="Reclaim";

//2018-8-17
"eos_action_no_cpu"="CPU resource is insufficient, please go to the resource management page to get.";
"eos_action_no_net"="NET resource is insufficient, please go to the resource management page to get.";
"res_title_reclaim_from"="From account";
"title_current_price"="Price";
"title_current_staked"="Reclaimable";

//2018-8-20
"transaction_tips_iq"="IQ contract has fee with transfer 0.1 percent";
"title_res_old"="Old";

//2018-8-29
"qrcode_timeout"="QR code has expired";

//2018-8-30
"sdk_auth_title"="Account Authorization";
"sdk_auth_tips"="The app will get the following permissions after authorization:";
"sdk_auth_tips_account"="Get your eos account information";
"sdk_auth_tips_no_pk"="Note: Account authorization will not provide your private key to DApp";
"sdk_auth_account"="Authorized Account:";
"sdk_auth_change_account"="Replace";
"sdk_auth_confirm"="Confirm authorization";
"sdk_auth_nopass"="Authorization verification does not pass";
"reclaim_account"="Reclaim account";
"multi_select"="Multi-select";
"reclaim_preview"="Reclaim preview";
"reclaim_acc_count"="Reclaim counts";
"err_tips_reclaim_input_cpu"="Incorrect inputs for CPU";
"err_tips_reclaim_input_net"="Incorrect inputs for NET";
"err_tips_cpu_net_nonnull"="CPU/NET input values should be non-null!";
"err_tips_cpu_value_over"="The CPU value must not be greater than the pawned value!";
"err_tips_net_value_over"="The NET value must not be greater than the pawned value!";
"reclaim_tips_max_count_6_per_chose"="Choose up to 6 at a time.";
"string_default_is_self"="(For self by default)";

//2018-9-3
"dapp_sign"="Signature";
"dapp_sign_info"="Content";

"tip_sdk_transfer_no_wallet"="No proper wallet";
"tip_sdk_transfer_no_specified"="No specified wallet";
"sdk_transfer_from"="Payment account";
"sdk_transfer_to"="Receiver account";
"tip_trans_reaffirm_cancel"="Sure to cancel the transaction?";
"pay_for_trans"="Payment";
"transfer_contract"="Contract";

"tips_enter_the_url"="Please enter the URL";
"tip_clear_record"="Sure to clear the records?";
"clear_records"="Clear records";

//2018-9-4
"dapp_action_warnning"="Attentions!! This action contains auth related info >";
"tips_dev_mode_changed"="Developer mode has been incorporated into the 「DApp Browser」";

//2018-9-6
"import_imported"="Imported";

//2018-9-11
"receiver_account_name"="Receiver account";
"receiver_account_is_contract"="The payee account you input is a contract account. Since the contract can be modified, please ensure that the contract is safe before transferring.";
"collect"="Star";
"cancel_collect"="Cancel Star";

//2018-9-13
"sdk_push_transaction_title"="Contract actions";
"sdk_push_transaction_required"="Request permissons";
"sdk_push_transaction_detail"="View actions details";
"sdk_push_transaction_account"="Execute account name";
"sdk_push_transaction_operation"="Action list";

//2018-9-14
"wallet_not_found"="The wallet was not found";
"set_time_transfer_tips"="Timed transfer may be biased due to network reasons, make adequate network confirmation before using this function to ensure the correctness of the setting time.Attention,we don't support cancel delay on this version";
"set_time_transfer"="Set transfer time";

"title_my_dapp"="My DApps";
"tips_input_dapp"="Search for DApp or enter a link to play";
"tips_search_null_dapp"="Search DApps";
"my_stars"="My Stars";
"unknown"="Unknown";
"set_time_transfer_time_tips"="Select cannot be less than the current time";
"rcmd_dapps"="Recommended";
"go_to_dapp"="Go to DApp: ";

"NSCameraUsageDescription"="TokenPocket needs access to your camera to scan QRCode.";
"NSFaceIDUsageDescription"="TokenPocket needs access to FaceID to do identity recognition.";
"NSPhotoLibraryAddUsageDescription"="TokenPocket needs access to albums to recognize pictures for you.";
"NSPhotoLibraryUsageDescription"="TokenPocket needs access to albums to recognize pictures for you.";

//2018-9-25
"edit"="Edit";
"dapp_whitelist"="Whitelist details";
"dapp_sign_auth"="Signing Request";
"dapp_whitelist_property"="Property";
"dapp_whitelist_operation"="Action";
"dapp_whitelist_add_ask"="Add to the whitelist?";
"dapp_whitelist_add_desc"="You can whitelist this action and don't have to authorize it next time. Checking the box next to the attribute means that you can allow this property for this action to change.";
"dapp_whitelist_pwd_title"="Enter password to enable whitelist";
"dapp_whitelist_pwd_desc"="Whitelist authorization is only valid during DApp lifecycle, exiting DApp, or exiting the app will invalidate the authorization. The next time you use the whitelist, you will need to enter the password to enable the whitelist.";
"dapp_whitelist_title"="Whitelist";
"dapp_whitelist_cancel_contract"="Cancel";
"tips_observe_wallet_operation_disabled"="Wallet in the observation mode has no permission to continue!";
"tips_public_key_import"="Observing the wallet does not require importing a private key. It only imports the account name or public key, and performs daily viewing of accounts, transaction records, and receiving notifications.";
"observer_wallet"="Observer";
"observer_wallet_mode"="Observer";
"tips_alert_observer_wallet_receipt"="Current account is in the observer mode, are you sure to transfer to this account?";
"title_receive_noti"="Receive Notification";

//2018-9-30
"dapp_select_account_empty"="Your wallet is empty~";
"dapp_whitelist_pass_tips"="This operation has authorized a whitelist without entering a password.";
"dapp_whitelist__timeout_pwd_desc"="This whitelist authorization has expired, please enter the password to restart the whitelist.";

"hot_search" = "Hot Searches";
"history_records"="Records";
"splash_title_skip"="Skip";

//2018-10-10
"dapp_whitelist_property_any"="Any";
"dapp_whitelist_cycle_app"="Valid before exiting APP";

"tips_pub_acc_import_error"="The public key or account is incorrect!";

//2018-10-17
"pay_touchid_tips"="Use Touch ID before exit app";
"pay_faceid_tips"="Use FaceID before exit app";
"pay_touchid"="Pay through Touch ID";
"pay_faceid"="Pay through FaceID";
"pay_valite_password_title"="Verify password";
"pay_valite_password_placeholder"="Wallet password";

"add_wallet"="Add Wallet";
"tips_have_accounts_or_not"="Do you have an account?";
"tips_have_wallets_or_not"="Do you have a wallet?";
"i_have_accounts"="I have an account";
"i_have_no_account"="No account";
"i_have_wallets"="I have a wallet";
"i_have_no_wallet"="No wallet";

"friend_create"="Create by Friend";
"contract_trans_create"="Smart Contract";
"free_account"="Free Account";
"invitation_code_create"="Activation Code";

"tips_row_import_wallet"="Support private key importing and Observer Mode";
"tips_free_account_create"="Use the TokenPocket official free accounts";
"tips_by_friend_create"="Ask your friend who has an account to pay the fee";
"tips_by_invitation_code_create"="Purchase activation code through PayPal to create an account";
"tips_by_contract_trans_create"="Transfer the fee to a contract account to create an account";

//2018-10-21
"invite_account_create_fail"="Create failed, please remember the invite code and contact customer service";
"invite_account_code_invalid"="The invite code does not exist or has been used";
"invite_account_check_tips"="The account has already been submitted to EOS mainnet, we suggest extra wait (3 mins) to ensure the creation is successful.";

//2018-10-22
"account_backup_no_screen_tips1"="If someone gets your private key, he will get your assets directly!";
"account_backup_no_screen_tips2"="Please write your private key on paper and store it in a safe place";
"key_use_tips"="Tips: Please backup the private key before using the key";
"invite_get_code"="Get Code";

"tips_pls_add_wallet"="Please add a wallet first";

"create_account"="Create Account";
"import_account"="Import Account";

//2018-10-24
"invitation_code"="Code";

//2018-10-25
"wallet_current"="Current";

//2018-10-28
"advanced_settings"="Advanced";
"advanced_settings_tips"="You don’t need to confirm the pop up information next time until you turn the advanced setting off";
"whitelist_open_tips"="DApp’s whitelist has moved to App Setting, meanwhile, we added an advanced mode to improve the experience. Do you wanna turn it on?";
"advanced_tips"="The action has been added to the whitelist, and the advanced settings are enabled. After authorization, the operation will be executed immediately. Whether to continue?";
"whitelist_operation"="Enable Whitelist";
"advanced_operation_doing" = "Doing";

//2018-10-31
"dapp_whitelist_advanced_pass_tips"="This action was added to advanced mode, no pop-up confirmation after authorized";

//2018-11-1
"eos_transaction_unable_complete"="The transaction is not completed, please check your resource.";

//2018-11-7
"token_detail_title"="Token Details";
"token_detail_info"="Project Details";
"wallet_share_no_import"="No wallets need import";
"wallet_share_no_support"="Data does not support data migration because it has not been updated long time.";
"wallet_share"="Sync data to App Store version";

//2018-11-8
"wallet_share_title"="Wallet Data Migration";
"wallet_share_about"="About data migration";
"wallet_share_about_tips_1"="Because the InHouse version does not guarantee long-term stable services and some features are missing. In order to enable users to enjoy stable services, and more powerful features, while reducing the complicate work for users, we provide the function to migrate InHouse version to AppStore version.";
"wallet_share_about_tips_2"="In the migration process, there is no data leakage problem. Since the data is full-encrypted, no one can crack it except the user to decrypt it. After the migration panel pops up, select TokenPocket to start data migrating.";
"wallet_share_attention"="Migration Considerations";
"wallet_share_about_attention_1"="This operation only migrates wallet data, don't support other data this time,and the App Store version must be greater than or equal to 1.0.7.";
"wallet_share_about_attention_2"="If the migration fails or partly fails, please try again until it succeeds. Multiple migrations will not cause data confusion or loss.";
"wallet_share_about_attention_3"="Data migration will not affect the existing wallet of the App Store version. If the App Store version has the same wallet, it will be automatically ignored, but if it is an observed wallet, it will be overwritten.";
"web_refresh_desc"="Click to reload";
"wallet_share_begin"="Start migrating";
"wallet_share_to_appstore"="Download App Store version";
"rsrc_widget"="Resource Widget";
"my_invitation_code"="My invite code";

//2018-11-21
"res_rent_cpu"="Rent";
"recent_transfer_account"="Recent Transfers";
"recent_transfer"="Transfer";
"recent_transfer_contact"="Contact";
"recent_transfer_scan"="Scan QRCode";

//2018-11-22
"asset_colletion_doing"="Doing";
"asset_colletion_success"="Successful";
"asset_colletion_fail"="Failed";
"asset_colletion_fail_net"="Failed, please check the network and try again";
"asset_colletion_cancel"="Discontinued";
"asset_colletion_select_account"="Please select an account to begin";
"input"="Enter ";
"s_password"="'s password";
"check_net_point"="Please check network and endpoint";
"home_show"="Homepage Displays";

"see_more"="See More";
"recent"="Recent";

//2018-11-27
"asset_colletion"="Asset Colletion";
"more_utilities"="More Tools";
"dapp_detail"="DApp Details";

//2018-11-28
"asset_colletion_confirm_tips_1"="Confirm to collect all ";
"asset_colletion_confirm_tips_2"=" to the  account ";

//2018-12-3
"no_net_tips"="Unable to connect network, please check the APP network permissions if your network works normally.";

//2018-12-11
"screen_rotation"="Screen Rotation";
"transaction_cancel"="Transaction Cancelled";
"sign_invalid"="Invalid Signature";
"scan_by_cold_wallet"="Scan through cold wallet";
"scan_by_observer_wallet"="Scan through observe wallet";
"wallet_has_net"="Online environment";
"cold_wallet_knowledge"="Cold Wallet Tips";
"cold_wallet_knowledge_1"="Cold wallet is also called offline wallet. Import the keys into cold wallet and keep offline to ensure the security of the assets. ";
"cold_wallet_knowledge_2"="Cold wallet communicate with observe wallet through QR Code, keys never connect to the net, which can effectively prevent hackers from stealing";
"cold_wallet"="Cold Wallet";

"push_noti"="Notifications";
"transfer_noti_normal"="Normal Wallet Transfer Notice";
"transfer_noti_observe"="Observing Wallet Transfer Notice";

//2018-12-12
"use_ob_scan"="Use the hot wallet to scan the QR code to import corresponding account";
"recent_transfer_warn"="We use the memo you used last time, please check that";

"visitor_mode"="Visitor Mode";
"visitor_mode_desc"="Quick Enjoy";
"eos_novice_teach"="EOS Tutorial";
"visitor"="Visitor";
"tips_alert_visitor_receipt"="Visitor mode cannot do this";
"defautl_creater_public_key"="Default is the creator's public key";

//2018-12-17
"scan_sign"="Signature";

"cold_wallet_cant_login"="Cold wallet cannot be logged in directly";

//2019-1-2
"plz_input_wallet"="Please enter the wallet name";
"net_online"="Currently is online environment, continue?";
"all_assets"="All Assets";
"no_zero_assets"="Amount > 0";
"dex_list"="Exchange List";
"go_transaction"="Trading";

"ever_open"="Permanent";
"had_opened"="Opened";
"not_open"="Not Open";
"had_closed"="Closed";
"attention_things"="Attentions";

"temp_pay_by_touchID"="Pay by Touch ID temporarily";
"ever_pay_by_touchID"="Pay by Touch ID for ever";
"temp_pay_by_faceID"="Pay by Face ID temporarily";
"ever_pay_by_faceID"="Pay by Face ID for ever";

"open_pay_by_touchID"="Open Touch ID Payment";
"close_pay_by_touchID"="Close Touch ID Payment";
"open_pay_by_faceID"="Open Face ID Payment";
"close_pay_by_faceID"="Close Face ID Payment";

"temp_touchID"="Temporary Touch ID";
"ever_touchID"="Permanent Touch ID";
"temp_faceID"="Temporary Face ID";
"ever_faceID"="Permanent Face ID";

"open_by_touchID"="Open Touch ID";
"close_by_touchID"="Close Touch ID";
"open_by_faceID"="Open Face ID";
"close_by_faceID"="Close Face ID";

"ever_auth_description"="      Permanently no-password use the device's biometric technology to confirm whether the user is the device's owner, using the identification feature and security encryption algorithm to encrypt, except for the device owner, others cannot obtain the password.";

"ever_auth_sub_attention_title"="Please ensure the following attentions before opening:";
"ever_auth_attention_points1"="Do not add Touch ID/Face ID of others on this device.";
"ever_auth_attention_points2"="The device passcode of the iOS device can manage the Touch ID/Face ID of the device, do not reveal the device passcode.";
"ever_auth_attention_points3"="If the device is jailbroken, it is not recommended to enable this feature.";
"tip_returnd_because_ever_bio_auth"="Permanent option is enabled, no need to open temporary option";

"app_lock"="Unlock Setting";

"title_faceid"="Face ID";
"title_touchid"="Touch ID";

//2019-1-5
"token_suppot"="Current Token only supports ";

//2019-1-14
"bos_map_time_desc"="\tSnapshot took on EOS Mainnet at 2019-Jan-01, 09:50 UTC+0, about block height #35072000, so those accounts not created before this time, will not have related accounts in BOS
";
"bos_map_rule"="Map rule:";
"bos_map_rule_1"="For non-msig accounts, calculate the balance of an EOS Mainnet account on BOS Mainnet, 20.0000 EOS on EOS Mainnet can get 1.0000 BOS on BOS Mainnet and the accounts whose balance is smaller than 0.5000 BOS will be given at least 0.5000 BOS";
"bos_map_rule_2"="For msig accounts, the balances are calculated as the same as non-msig accounts, and we do an auth mapping of it's permissions";
"bos_map_rule_3"="Generate a random name for EOS Mainnet accounts";
"bos_map_rule_4"="Accounts are created with: 0.3000 BOS ram, 0.1000 BOS NET and 0.1000 BOS CPU on BOS Mainnet";
"begin_sync"="Start syncing";
"one_sync"="One-key Sync";
"one_sync_desc"="Sync the mapped EOS account to the BOS account";
"no_sync_account"="No account can be synchronized";
"sync_success"="Synchronization success";

"chat"="Chat";
"marketplace"="Markets";

//2019-1-29
"already_save_album"="Saved to Album";
"plz_auth_im"="Please login in the chat tab of the wallet";
"fetch_group_info_error"="Fail to get group info";
"upload_avatar"="Upload Avatar";
"choose_from_album"="Choose from Album";
"take_picture"="Take a Photo";
"modify_nickname"="Change Name";
"nickname_no_empty"="name cannot be empty";
"nickname_too_long"="name is too long";
"follow"="Follow";
"unfollow"="Unfollow";
"dapps_playing"="His dApps";
"im_personal_acc"="Account: ";
"req_fail"="request failed";
"sex_or_violence"="Porn or Violence";
"illegal"="Illegal";
"other"="Others";
"report_success"="reported";
"report_fail"="failed";
"already_get"="Opened";
"already_expired"="expired";
"your_get_your_redpacket"="You take your own red packets";
"get_your_redpacket"="took your red packets";
"redpacket_is_full"="，red packets are finished";
"your_get"="You opened ";
"its_redpacket"="'s red packet";
"redpacket_get"=" opened ";
"tp_redpacket"="Red Packet";
"redpacket_is_full_cheer"="Red packets are finished，good luck";
"current_account_no_get"="Current account cannot take";
"redpacket"="RedPacket";
"im_tools_camera"="Camera";
"im_tools_photos"="Photos";
"redpacket_already_expired"="Red packet is expired";
"knock_redpacket_fail"="failed";
"read_detail"="details";
"send_readpacket"="Send Red Packet";
"best_wishes"="Best Wishes";
"member_all"="Total";
"group_member"=" members";
"change_to_fight_redpacket"="Change to Random Amount";
"change_to_normal_redpacket"="Change to Identical Amount";
"current_is_fight_redpacket"="Random Amount. ";
"current_is_normal_redpacket"="Identical Amount";
"total_amount"="Total";
"one_amount"="Each";
"plz_input_red_number"="Please enter number";
"sunday"="Sunday";
"saturday"="Saturday";
"friday"="Friday";
"thursday"="Thursday";
"wednesday"="Wednesday";
"tuesday"="Tuesday";
"monday"="Monday";
"yesterday"="Yesterday";
"early_morning"="AM ";
"morning"="AM ";
"afternoon"="PM ";
"evening"="Evening ";
"member"=" members";
"search_my_follow"="Search my follow";
"search_my_group"="Search my groups";
"search_result"="Result";
"my_follow"="My Follow";
"unfollow_fail"="unfollow failed";
"address_book"="Contact";
"my_group"="My Groups";
"exit_group_simple"="Exit";
"exit_group_faIl"="Exit failed";
"create_group"="Create";
"group_name_max_char"="Group name max length 20 chars";
"group_name_min_char"="Group name cannot be empty";
"group_intro_max_char"="max 250 chars at group introduction";
"create_fail"="failed";
"plz_input_group_name"="input group name";
"group_info"="Details";
"enter_chat"="Go chatting";
"apply_enter"="Join";
"exit_group"="Delete and Exit";
"group_owner_no_exit"="Admin cannot exit group";
"apply_send"="application sent";
"apply_fail"="apply failed";
"group_name"="Group Name";
"group_code"="QR Code";
"group_intro"="Group Info";
"group_members"="Members";
"message_not_notify"="Mute";
"report"="Report";
"kick"="Kick";
"kick_fial"="failed";
"add_member"="Add members";
"invite_success"="Invite successfully";
"invite_fail"="Invite failed";
"detail"="Details";
"personal_info"="Profile";
"message_top"="Sticky";
"message_cancel_top"="Unsticky";
"logging"="Logging";
"audio"="Voice";
"photo"="Photo";
"video"="Video";
"location"="Location";
"file"="Files";
"unknow_message"="Unknown message";
"group_update_message"="Group dynamics";
"account_kick_tips"="Logged on other device, check your security";
"account_blocked"="The account was banned";
"im_login_auth_fail"="Try again";
"current_not_support_im"="The current wallet can't chat";
"blockchain_error_tips"="Endpoint error, check it.";
"at_in_group"="You're mentioned";
"not_login_im"="Unlogged";
"save_album"="Save to Album";
"distinguish_album"="Extract QR Code";
"group"="Group";
"your"="You";
"change_room_queue"="Room queue changed";
"room_unmuted"="All unmuted";
"room_muted"="All muted";
"change_self_info"="Change personal info";
"unmute_personal"="Unmuted";
"mute_personal"="Muted";
"your_mote"="You're muted";
"unknow_system"="Unknown system message";
"mute"="Mute";
"unmute"="Unmute";
"be"="be";
"accept"="Approved";
"invite_group"="'s invitation";
"cancel_manager"="have been dropped the admin status";
"add_manager"="has being added as a admin";
"change_group_owner_to"="change Owner to ";
"invite"="invite ";
"dismiss"="Dismiss";
"removed"="Removed";
"will"="will";
"and_so_on"="etc";
"entered"="enters ";
"modify"=" update ";
"infomation"="information";
"passed"="approvel ";
"apply"="application ";
"leaved"="leaves";
"intro"="intro";
"auth_type"="Auth Type";
"group_notice"="Group Notice";
"avatar"="Avatar";
"change_group_invite_type"="Update his inviter's permission";
"change_group_beinvite_type"="Update his invitee's permission";
"change_group_info_update_auth"="Update group's modification permission";
"set_group_all_mute"="Set all mute";
"set_group_all_unmute"="Set all unmute";
"send"="Send";
"plz_import_wallet"="Please import the wallet first";
"im_profile_account"="Account";
"im_profile_nickname"="Nickname";
"im_group_recommend"="Recommended Groups";
"im_plz_input"="Text here";
"chat_log_tip"="Chat is closely related to your account, requires to verify your identity";
"chat_log_btn"="Verify";

"mins"="mins";
"next_round"="Next Round";
"chat_create_about"="About";
"chat_create_name"="Group Name";
"chat_create_about_pla"="Introduce the group briefly";
"chat_create_name_pla"="Set the group's name";

//2019-2-20
"authentication_message"="Verifications";
"alreay_accept"="Approved";
"alreay_refuse"="Unapproved";
"alreay_invalid"="Expired";
"apply_team"="Applies to join the group";
"refuse_apply"="Disapproved you to join the group";
"remove_team"="Remove";
"alreay_remove_team"="Was moved";
"accept"="Confirm";
"refuse"="Reject";
"net_error_tips"="Network error, try again";
"team_not_exist"="Group doesn't exist";
"clear_all"="Clear";
"share_a_dapp"="Shared a DApp";
"select_a_chat"="Select a chat";
"recent_chat"="Recent chat";
"alreay_send"="Sent";
"team_owner"="Owner";
"admin"="Admin";
"send_to"="Send To";
"whether_transfer_owner_to"="Transfer ownership to";
"admin_has_permission"="Admin's Permissions : ";
"admin_permission_1"="1. Group verification switch";
"admin_permission_2"="2. Permissions to confirm or reject applications";
"admin_permission_3"="3. Add or remove members from the group";
"team_members_limit"="Users number reaches limitation";
"join_team_fiter"="Group verification";
"transfer_team_owner"="Transfer Ownership";
"admin_manager"="Admins Management";
"owner_transfer_suc"="Transfer Successfully";
"owner_transfer_fail"="Transfer Failed";
"team_admin_limit_tips"="Up to 4 admins";
"add_suc"="Add Successfully";
"add_fail"="Add Failed";
"add_admin"="Add Admins";
"admin_list_and_tips"="Admins (slide to remove)";
"new_short_account_suf_must_tips"="New account suffix must be ";

"at_all"="all";
"at_you"="You were mentioned";
"forward"="Forward";
"recall"="Recall";
"did_send"="Send success";
"did_forward"="Forward success";
"multi_chain"="Multi-Blockchain";
"recalled_a_msg"="has recalled a message";
"im_you"="You ";
"quote"="Quote";
"tip_recall_expired"="Send for more than 2 minutes, cannot be recalled";
"has_recalled"="has recalled ";
"message"="message";
"im_your"="your ";
"im_de"="'s ";

//2019-2-20
"use_tp_scan_enter_team"="Use TokenPocket to scan join the group";
"share_qrcode"="Share QR Code";
"confirm_enter"="Confirm";
"whether_confirm_enter_team"="Join the group chat?";
"plz_enter_amount"="Please enter the amount";

"draft"="Draft";

//2019-3-7
"total_stake"="Total Mortgage";
"amount_up_1"="The amount can't be less than 1";
"refund_list"="Refund List";
"refund_amount"="Quantity";
"refund_time"="Time";
"account_in_5_11"="Account name's length should among 5 to 11";
"transaction_state_unknow_see_browser"="The status is unknown, you can go to the browser to check if the transaction is successful";
"gas_stake"="iGAS Mortgage";

"create_with_mobile_number"="Email/Phone";
"create_with_mobile_desc"="Register with the email or phone number";
"import_with_mobile_number"="Email/Phone";
"import_with_mobile_desc"="Sign in with the email or phone number";
"register"="Register";
"login"="Login";
"sign_in"="Sign in";

"import_with_pri_key"="Private Key";
"import_with_pri_key_desc"="Import the account with the private key";
"import_with_pub_key"="Observing Mode";
"import_with_pub_key_desc"="Enter an account with the account name or public key";
"import_with_cold"="Cold Wallet";
"import_with_cold_desc"="Import the account with the private key as an offline wallet";
"import_with_key_store"="Keystore";
"import_with_key_store_desc"="Add a wallet by importing a Keystore";
"import_with_mnemonic"="Mnemonic";
"import_with_mnemonic_desc"="Add a wallet by importing a mnemonic";
"stake_number"="Stake Amount";
"account_chars_5_11_tip"="5-11 chars in [a-z0-9_]";

"url_link"="Link";
"about_mobile_wallet"="About Email/Phone Wallet";
"use_email"="Use Email";
"use_phone"="Use Phone Number";
"plz_enter_phone_num"="Your phone number";
"plz_enter_email_addr"="Your email address";
"plz_enter_auth_code"="Verification Code";
"get_auth_code"="Get Code";
"retry"="Retry";
"phone_num_err"="The phone number is incorrect";
"email_num_err"="Email address is incorrect";
"tip_auth_code_be_used_plz_retry"="The verification code has expired or incorrect, please request it again.";
"tips_never_created_acc"="No account created";
"reg_will_agree"="Register that agree";
"and"="and";
"set_pwsd"="Set Password";
"your_account_name"="Your account name";
"your_email"="Your email address";
"your_phone"="Your phone number";
"plz_enter_actv_code"="Please enter the activation code";
"complete_creation"="Complete Creation";
"way_of_creation"="Creation Mode";
"way_of_payment"="Payment Mode";
"contact_us_if_any_question"="If you have any problem, please contact us.";
"tp_recovery"="TP Recovery";
"eos_faq_tp_recovery_title"="What is TP recovery permission?";
"eos_faq_tp_recovery_expl"="The registered user of the mobile phone number will have the TP recovery right, and the TP recovery right belongs to the owner authority. The user can recover the private key by means of mobile phone authentication if the user forgets or loses the private key. If the user deletes the privilege or makes the privilege threshold of the privilege lower than the owner privilege threshold, the TP will not help the user to perform private key recovery. When you use your mobile phone number to log in or restore your account, the old public key will be replaced. The new public key will be uploaded locally by the user.";
"tips_tp_help_recover_account"="The login operation will replace the old public key, All previous private key will be reset, determine login?";
"alert_delete_tp_recovery_right"="Delete or change the TP recovery right or reduce the weight of the right below the owner right threshold, TP will not be able to help you recover the private key, please confirm that the private key has been backed up. Are you sure to continue?";
"tip_eos_account_name_range_normal"="Account name consists of 1-5 and a-z characters, length is 12";
"tip_eos_account_name_range_short"="Account name consists of 1-5 a-z and . characters, length is 3-12";

"tip_already_exists"="Already exists";
"tip_available"="Available";
"tip_not_available"="Not available";
"tip_acc_length_should_be_%@_chars"="Account should be %@ chars";
"tip_acc_need_to_enter_%@_chars"="Need to enter %@ chars";

//2019-3-22
"tap_forward_setting"="Settings";
"set_asset_show"="Set token display";
"show_asset_set"="Show token settings";
"member_list"="Members List";
"voted_bp"="Voted: ";
"get_bonus"="Get Bonus";
"block_node"="Block";
"candidate_node"="Candidate";
"frozen"="Frozen";
"pull_fail"="Pull failed";

"tp_transfer"="TP Transfer";
"transfer_to_%@"="Transfer to %@";
"title_tansfer"="Transfer";
"receipt_tansfer"="Received transfer";
"apn_tip_im_receipt_transfer_%@"="[Transfer] Received transfer %@";
"tip_actv_code_can't_create_%@"="This activation code can't create %@";
"tip_actv_code_been_used"="This activation code has been used";
"tip_actv_code_cant_rgnz"="The activation code couldn't be recognized";
"tip_actv_code_auth_fail"="Activation code verification failed";
"tip_actv_code_not_payed"="Activation code not been paid";
"tip_actv_code_cpu_ram_fail"="CPU / RAM is not enough";
"tip_actv_code_update_code_fail"="Update code status failed";
"tip_search_token_empty_to_submit"="The token is not in the result? Tap to request it.";
"title_im_noti"="Chat message notification";
"i_know_temrs_below"="I know the followings:";
"password_can't_less_than_8_chars"="Password can't be less than 8 chars";
"set_account_name"="Account name";
"set_wallet_name"="Set wallet name";

"add_accounts"="Add Accounts";
"bp_rank"="Producers Rank";
"see_sign_info"="View signature content";
"sdk_sign_tips_no_pk"="Note: Information Signature will not provide your private key to DApp";
"tip_tp_code_copied_paste_it"="The TP code has been copied, please paste it~";
"common_code_copy_text_%@_then_open_in_tp"="Copy this text %@ and then open TokenPocket app";
"tp_cmd_key"="TP Code";
"param_error"="Parameter error";
"invite_friend_reg"="Invite New Friends";
"check_u_copied_a_tp_code"="Detect that you copied the TP Code";
"open_immediately"="Open";
"unknown_type_pls_update_version"="Unknown type, please update version";
"auto_filter_chars_%@"="Automatically filter chars: %@";
"random_account"="Random account";

//4-16
"amount_than_100k"="Must be greater than 0.01KB";
"add_repeat"="Repeat";
"iram_not_enough"="iRAM resources are insufficient, please go to the resource management page to get.";
"igas_not_enough"="iGas resources are insufficient, please go to the resource management page to get.";
"sell_iram_not_enough"="The iRAMs that can be sold is insufficient";
"unstake_amount_not_enough"="Unpledge amount is insufficient";
"select_bps:"="Selected: ";
"voted_proxy"="Voted";
"none"="None";
"pk_exprot_warnning"="Warning: The private key is not encrypted.";
"powered_by_eosAuth"="Data Powered By EOSAuthority";

"current_fund"="Current blockchain";
"tap_to_switch"="Switch";

"tip_multy_ways_to_create"="Create in multiple ways";
"selected"="Selected";
"z_news"="News";

"iost_refund_list"="Redeem List";
"iost_vote_title_producer"="Nodes Voting";
"iost_bp_rank"="Nodes Rank";


"batch_creation"="Batch Creation";
"batch_random"="Batch Random";
"new_account_puk"="Account public key";
"resource_dispatch"="Resource configuration";
"indicates_account_available"="Account is available";
"indicates_account_unavailable"="Account is unavailable";
"estimate_cost"="Expected cost:";
"begin_create"="Start Creating";
"batch_tips_1_%@"="The new accounts will share the same public key with the %@,you can tap here to modify it.";
"batch_tips_1_1"="Tap here to return to the default public key";
"batch_tips_2"="Each new account contains: RAM 4 kb, CPU 0.05 EOS, NET 0.01 EOS, you can tap here to modify it.";
"batch_tips_2_1"="Tap here to return to the default resource configuration";
"tap_this"="Tap here";
"custom_account"="Custom Account";
"create_account_num"="Create Quantity";
"import_after_creation"="Is it automatically imported after creation?";
"import"="Import";
"not_import"="Not Import";
"create_result"="Create Result";
"create_success"="Created Successfully";
"create_fail"="Create Failed";
"unfold"="Unfold";
"batch_password_tips"="* The account will be imported using the password";
"account_input_or_ramdon"="Enter account or click to generate randomly";
"add_one"="Add One";
"account_grade_alert_content"="Because your current asset quota exceeds 10 EOS, Recommends you upgrade account to a personal account.";
"go_greade"="Go";
"next_time"="Next Time";
"account_grade"="Account Upgrade";
"account_grade_tips_content"="You have successfully backed up, we will help you upgrade your account from a partnership one to an individual one.";
"account_grade_read"="Please read the following carefully :";
"account_grade_read_1"="This upgrade will remove the TP recovery permission. After that, you won’t be able to log in through mobile number nor email";
"account_grade_read_2"="After removing, you can only use the private key just backed up to recover, please keep your keys safe.";
"account_grade_read_3"="If you don’t upgrade your account this time, the key you just backed up will be invalid when you log in through email or mobile number next time";
"account_grade_already_read"="I have read and understand the above";
"grade_first”=“Upgrade";
"grade_success"="Upgrade Successfully";
"grade_fail"="Upgrade Failed";
"not_confirm_exit_app"="The DAPP does not reconfirmed before exiting Tokenpocket";
"third_parties"="Third-Parties";
"third_parties_desc"="Create your account through popular third-parties";

"create_jion_team_code"="Generate TP Code";
"save_to_local"="Save";
"share_group"="Share the group";
"join_immediately"="Join Now";
"select_region"="Select Region";
